<?php
/**
 * 数据状态表
 * 说明：
 * 
 * @Author: hzz
 * @Date: 2017/8/29
 * 
 */
$datastatus = array(
    '1' => '可用',
    '0' => '不可用'
);

//工作状态
$work_status = array(
    '1' => '离职，正在找工作',
    '2' => '在职，正在找工作',
    '3' => '在职，有好机会才考虑',
    '4' => '暂无跳槽打算',
    '5' => '在校学生',
    '6' => '应届生'
);

//教育形式
$education_mode = array(
    '0' => '普通高等教育',
    '1' => '自考',
    '2' => '成人全日制脱产',
    '3' => '成人函授/远程教育',
    '4' => '军校',
    '5' => '党校',
    '6' => '基础教育',
    '7' => '其他',
);

//学历水平
$degree_status = array(
    '1' => '本科',
    '2' => '硕士',
    '3' => '博士',
    '4' => '大专',
    '5' => '高中',
    '6' => '职高/中专',
    '7' => '不限学历'
);

